
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Продажи.Записать();
	
	// !!! ОШИБКА !!! - новая методика + контроль еще и суммы, а не только количества
	
	//Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	РасходДенегСписокНоменклатуры.Номенклатура КАК Номенклатура,
	//	|	РасходДенегСписокНоменклатуры.Договор КАК Договор,
	//	|	СУММА(РасходДенегСписокНоменклатуры.Количество) КАК Количество,
	//	|	СУММА(РасходДенегСписокНоменклатуры.Сумма) КАК Сумма,
	//	|	СУММА(РасходДенегСписокНоменклатуры.СуммаВыплаты) КАК СуммаВыплаты
	//	|ПОМЕСТИТЬ ВТТовары
	//	|ИЗ
	//	|	Документ.РасходДенег.СписокНоменклатуры КАК РасходДенегСписокНоменклатуры
	//	|ГДЕ
	//	|	РасходДенегСписокНоменклатуры.Ссылка = &Ссылка
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	РасходДенегСписокНоменклатуры.Номенклатура,
	//	|	РасходДенегСписокНоменклатуры.Договор
	//	|
	//	|ИНДЕКСИРОВАТЬ ПО
	//	|	Номенклатура,
	//	|	Договор
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТТовары.Номенклатура КАК Номенклатура,
	//	|	ВТТовары.Договор КАК Договор
	//	|ИЗ
	//	|	ВТТовары КАК ВТТовары";
	//Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//// блокировки
	//Блокировка = Новый БлокировкаДанных;
	//ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Продажи");
	//ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	//ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	//ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	//ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Договор", "Договор");
	//Блокировка.Заблокировать();
	//
	//
	//// остатки
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ПродажиОстатки.Номенклатура КАК Номенклатура,
	//	|	ПродажиОстатки.Договор КАК Договор,
	//	|	ПродажиОстатки.КоличествоОстаток КАК КоличествоОстаток,
	//	|	ПродажиОстатки.СуммаОстаток КАК СуммаОстаток,
	//	|	ПродажиОстатки.СуммаВыплатыОстаток КАК СуммаВыплатыОстаток
	//	|ПОМЕСТИТЬ ВТОстатки
	//	|ИЗ
	//	|	РегистрНакопления.Продажи.Остатки(
	//	|			&Момент,
	//	|			(Номенклатура, Договор) В
	//	|				(ВЫБРАТЬ
	//	|					ВТТовары.Номенклатура КАК Номенклатура,
	//	|					ВТТовары.Договор КАК Договор
	//	|				ИЗ
	//	|					ВТТовары КАК ВТТовары)) КАК ПродажиОстатки
	//	|
	//	|ИНДЕКСИРОВАТЬ ПО
	//	|	Номенклатура,
	//	|	Договор
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТТовары.Номенклатура КАК Номенклатура,
	//	|	ВТТовары.Договор КАК Договор,
	//	|	ВТТовары.Количество КАК Количество,
	//	|	ВТТовары.Сумма КАК Сумма,
	//	|	ВТТовары.СуммаВыплаты КАК СуммаВыплаты,
	//	|	ЕСТЬNULL(ВТОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	//	|	ЕСТЬNULL(ВТОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	//	|	ЕСТЬNULL(ВТОстатки.СуммаВыплатыОстаток, 0) КАК СуммаВыплатыОстаток,
	//	|	ВТОстатки.Номенклатура.Представление КАК НоменклатураПредставление
	//	|ИЗ
	//	|	ВТТовары КАК ВТТовары
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстатки КАК ВТОстатки
	//	|		ПО ВТТовары.Номенклатура = ВТОстатки.Номенклатура
	//	|			И ВТТовары.Договор = ВТОстатки.Договор";
	//
	//Запрос.УстановитьПараметр("Момент", МоментВремени());
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//// регистр Продажи Расход
	//Движения.Продажи.Записывать = Истина;
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	
	//	Если ВыборкаДетальныеЗаписи.Количество > ВыборкаДетальныеЗаписи.КоличествоОстаток Тогда
	//		Сообщение = Новый СообщениеПользователю;
	//		Сообщение.Текст = "По номенклатуре " + ВыборкаДетальныеЗаписи.НоменклатураПредставление + 
	//					" не отчитались за меньшее количество, чем в документе, на: " + (ВыборкаДетальныеЗаписи.Количество - ВыборкаДетальныеЗаписи.КоличествоОстаток);
	//		Сообщение.Сообщить();
	//		Отказ = Истина;
	//	КонецЕсли;
	//	
	//	Если НЕ Отказ Тогда
	//		
	//		Движение = Движения.Продажи.Добавить();
	//		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//		Движение.Период = Дата;
	//		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
	//		Движение.Договор = ВыборкаДетальныеЗаписи.Договор;
	//		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
	//		Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;
	//		Движение.СуммаВыплаты = ВыборкаДетальныеЗаписи.СуммаВыплаты;
	//	
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
	// 1. Получение данных
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходДенегСписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	РасходДенегСписокНоменклатуры.Договор КАК Договор,
		|	СУММА(РасходДенегСписокНоменклатуры.Количество) КАК Количество,
		|	СУММА(РасходДенегСписокНоменклатуры.Сумма) КАК Сумма,
		|	СУММА(РасходДенегСписокНоменклатуры.СуммаВыплаты) КАК СуммаВыплаты
		|ИЗ
		|	Документ.РасходДенег.СписокНоменклатуры КАК РасходДенегСписокНоменклатуры
		|ГДЕ
		|	РасходДенегСписокНоменклатуры.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходДенегСписокНоменклатуры.Номенклатура,
		|	РасходДенегСписокНоменклатуры.Договор";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// 2. Формирование набора записей
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.Продажи.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.Договор = ВыборкаДетальныеЗаписи.Договор;
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;
		Движение.СуммаВыплаты = ВыборкаДетальныеЗаписи.СуммаВыплаты;
		
	КонецЦикла; 
	
	// 3. Установка блокировок
	// 4. Запись всех наборов
	Движения.Продажи.Записывать = Истина;
	Движения.Продажи.БлокироватьДляИзменения = Истина;
	Движения.Записать();
	
	// 5. Контроль данных
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажиОстатки.Номенклатура КАК Номенклатура,
		|	ПродажиОстатки.Договор КАК Договор,
		|	ПродажиОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ПродажиОстатки.СуммаОстаток КАК СуммаОстаток,
		|	ПродажиОстатки.СуммаВыплатыОстаток КАК СуммаВыплатыОстаток
		|ИЗ
		|	РегистрНакопления.Продажи.Остатки(
		|			&Момент,
		|			(Номенклатура, Договор) В
		|				(ВЫБРАТЬ
		|					ВТТовары.Номенклатура КАК Номенклатура,
		|					ВТТовары.Договор КАК Договор
		|				ИЗ
		|					ВТТовары КАК ВТТовары)) КАК ПродажиОстатки
		|ГДЕ
		|	(ПродажиОстатки.КоличествоОстаток < 0
		|			ИЛИ ПродажиОстатки.СуммаОстаток < 0)";
	
	Запрос.УстановитьПараметр("Момент", МоментВремени());
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.КоличествоОстаток < 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "По номенклатуре " + ВыборкаДетальныеЗаписи.НоменклатураПредставление + 
					" не отчитались перед комитентом за меньшее количество, чем в документе, на: " + (-ВыборкаДетальныеЗаписи.КоличествоОстаток);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.СуммаОстаток < 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "По номенклатуре " + ВыборкаДетальныеЗаписи.НоменклатураПредставление + 
					" не отчитались перед комитентом за меньшеую стоимость товара, чем в документе, на: " + (-ВыборкаДетальныеЗаписи.СуммаОстаток);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
